/*
 * Функция-помошник, которая добавляет каждый элемент из source в target
 * но только в том случае, если его еще нет в target.
 * target МОЖЕТ (но не обязательно ДОЛЖЕН) мутироваться.
 * 
 * Эта функция может как возвращаеть массив с новыми элеметами, 
 * так и не возвращать никого результата, а просто изменять target
 */
export const pushUniqueValues = (target, source) => null;

/*
 * Основная функция, которая мержит массивы используюя pushUniqueValues
 */
export const mergeArrays = () => {
  // тут решение, в котором используется 
};
